云计算部署与管理
NSD CLOUD  DAY04

1.阿里云产品
2.华为云
3.ECS云服务器管理
##################################################################################   
阿里云产品
● 云计算基础
  & 什么是云?
   • 对于到底什么是云计算,至少可以找到100种解释
   • 现阶段广为接受的是美国国家标准与技术研究院
    (NIST)定义:
      – 云计算是一种按使用量付费的模式,这种模式提供可
      用的、便捷的、按需的网络访问, 进入可配置的计算
      资源共享池(包括网络,服务器,存储,应用软件,
      服务),这些资源能够被快速提供,只需投入少量的
      管理工作,或与服务供应商进行很少的交互
  & 云计算三大服务模式
   软件、应用        SaaS   Software-as-a-Service
   平台、运行环境    PaaS   Platform-as-a-Service
   基础设施          IaaS   Infrastructure-as-a-Service
   
  & 知名云服务商
   • 国外:亚马逊AWS、微软Azure、IBM SCE+、......
   • 国内:华为云、阿里云、百度云、腾讯云、......
   
  & 云计算产品选购建议
  • 要考虑服务商的知名度、靠谱度
  • 以个人/企业实际需求为本
      – 比如云主机、数据库、CDN、安全等,选择性价比最优的
##################################################################################      
● 阿里云产品和技术
   • 阿里巴巴业务增长的推手
   • 为阿里巴巴30个业务提供底层技术支持
● 阿里云简介
● 阿里云的体系架构
● 阿里云应用架构
● 架构建议总览
● 基础应用架构
● 弹性应用架构
##################################################################################
华为云





















