#############################
--- 子网掩码：用来标识网络位与主机位；用1标识网络位，用标识主机位
   例子：192.168.1.1（24个网络位，8个主机位）C类IP地址
   192.168.1.1  255.255.255.0 与下面相等
   192.168.1.1/24   24个网络位
   ########################################
-- 查看IP地址：
Ipconfig 
#######################################
虚拟机
虚拟化软件：虚拟计算机硬件，用真的虚拟出假的，最终假的能够当真的来用
VMware（WINDOWS）
KVM（Linux）
  ######################################
克隆
关闭Windows2008进行克隆
192.168.1.1
192.168.1.2

  ####################################
测试通信命令ping 一次ping操作是双向的，有来有回、
关闭Windows2008防火墙
 ###############################
