Python自动化运维 day01
1.教学支持、坚持
2.课程安排
   2.1 python开发入门
   2.2 python开发进阶
    2.3 运维开发实战
   2.4 web开发实战
3.鸡血
4.python简介
   4.1 环境
   4.2 pycharm
5. git
##############################################################################
开班
●教学支持
  616720276 QQ群
●坚持
  1.每天500行
  2.分清主次
  3.多动手
●老师:
  石博文： 1311794174 #QQ
  教学群： 616720276 
##############################################################################
python简介
●python起源
Guido van Rossum 作者  1991年

●python版本 
  python2.X 目前所有系统默认支持的版本
  python3.X 
  — 2009年发布
  — 语法有较大的调整
  — python的发展趋势
  — 学习python3.7.1稳定版
  
●为什么要学python
  — 高级：有高级的数据结构，缩短开发时间与代码量，非常的简洁；
  — 面向对象：为数据和逻辑相分离的结构化和过程编程添加了新的活力
  — 可升级：提供了基本的开发模块，可以在他的上面开发软件，实现代码重用
  — 可扩展：通过将其分离为多个文件或模块加以组织管理

●python网站
 https://www.python.org/

##############################################################################
设置pycharm  #教学环境默认有
● Pycharm是由JetBrains打造的一款Python IDE
● 支持的功能有:
–  调试、语法高亮
–  Project管理、代码跳转
–  智能提示、自动完成
–  单元测试、版本控制
● 下载地址:https://www.jetbrains.com/pycharm/download

● 使用pycharm
打开pycharm
选择create new project
在左上角找到file-----setting----editor
找到editor——font——size
解释器editor—project——project interpreter
左侧小齿轮Add local
选择虚拟环境 /usr/local/bin/python3.6  添加3.6
##############################################################################
环境准备
案例1:准备python开发环境
1.  下载最新版本的python3
2.  下载pycharm社区版
3.  安装python3,使其支持Tab键补全
4.  配置pycharm,使其符合自己的习惯
##############################################################################
git











































